// 리액트 컨텍스트(React Context)란?
// 리액트 컨텍스트는 컴포넌트 트리 전체에 데이터를 전역적으로 공유할 수 있는
// 기능입니다.
// 기존의 props를 통해 부모에서 자식으로 데이터를 하나하나 전달하는 방식과 달리,
// 컨텍스트를 사용하면 컴포넌트 간 데이터를 손쉽게 공유할 수 있습니다.

// 컨텍스트는 다음과 같은 경우에 유용합니다:
// - 다크모드/테마 설정
// - 사용자 인증 상태 관리
// - 다국어(다중 언어) 설정
// - 전역 상태 관리 (작은 프로젝트의 경우 Redux 없이도 사용 가능)

// 텍스트 사용 시 주의할 점
// - 빈번한 상태 변경은 피하는 것이 좋습니다.
// - 컨텍스트는 전역적으로 데이터를 공유하지만
//  상태가 자주 변경되면 하위 컴포넌트들이 불필요하게 다시 렌더링될 수 있습니다.

// Redux와 비교
// 간단한 전역 상태 관리는 컨텍스트로 충분하지만,
// 복잡한 상태 관리가 필요하면 Redux나 Zustand 같은
// 상태 관리 라이브러리를 사용하는 것이 더 좋습니다.

// 컨텍스트 주요 구성 요소
// 1.React.createContext()
// 컨텍스트를 생성하는 함수입니다.
// 2.Provider
// 데이터를 제공하는 컴포넌트로, 하위 컴포넌트들이 이 데이터를 사용할 수 있게 해줍니다.
// 3.Consumer
// 보통 useContext 훅을 사용해 간단하게 데이터를 소비합니다.

import React from "react";

//Context는 전역 상태 변수 저장소이다.
const ThemeContext = React.createContext();
ThemeContext.displayName = "ThemeContext";

export default ThemeContext;
